# 第五章 pandas入门

pandas与numpy最大的不同是pandas是专门为处理表格和混杂数据设计的，
而numpy更适合处理统一的数值数组数据。

series

Series是一种类似于一维数组的对象，它由一组数据（各种Numpy数据类型）
以及一组与之相关的数据标签（即索引）组成。

In [2]:
import pandas as pd
obj = pd.Series([4,7,-5,3])

In [3]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

Series的字符串表现形式为：索引在左边，值在右边。由于没有为数据指定索引，
于是会自动创建一个0到N-1（N为数据的长度）的整数型索引。
可以通过Series的values和index属性获取其数组表示形式和索引对象

In [4]:
obj.values

array([ 4,  7, -5,  3])

In [5]:
obj.index # like range(4)

RangeIndex(start=0, stop=4, step=1)

通常，创建Series带有一个可以对各个数据点进行标记的索引：

与普通Numpy数组相比，可以通过索引的方式选取Series中的单个或一组值：

In [6]:
obj2 = pd.Series([4,7,-5,3],index = ['d','b','a','c'])

In [7]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [8]:
obj2['a']

-5

In [10]:
obj2['d']

4

In [11]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

['d', 'b', 'a', 'c']是索引列表，即使它包含的是字符串而不是整数。

使用NumPy函数类似NumPy的运算（如根据布尔型数组进行过滤、标量惩罚、
应用数学函数等）都会保留索引值的链接：

In [14]:
a = obj2>0
a

d     True
b     True
a    False
c     True
dtype: bool

In [16]:
obj2[a]

d    4
b    7
c    3
dtype: int64

In [17]:
obj2[obj2 > 2]

d    4
b    7
c    3
dtype: int64

In [18]:
obj2*2

d     8
b    14
a   -10
c     6
dtype: int64

In [19]:
import numpy as np
np.exp(obj2)

d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

可以将Series看成一个定长的有序字典，因为它是索引值到数据值的一个映射；

In [20]:
'b' in obj2

True

In [21]:
'e' in obj2

False

如果数据被存放在一个python字典中，也可以直接通过这个字典来创建Series

In [22]:
sdata = {'a':1,'b':2,'c':3}

In [23]:
obj3 = pd.Series(sdata)

In [24]:
obj3

a    1
b    2
c    3
dtype: int64

In [25]:
obj3['a']

1

如果只传入一个字典，则结果Series中的索引就是原字典的键（有序排列）。
也可以传入排好的字典的键以改变顺序：

In [34]:
states = ['b','d','a','c']
obj4 = pd.Series(sdata,index = states)

In [35]:
obj4

b    2.0
d    NaN
a    1.0
c    3.0
dtype: float64

sdata中跟states索引相匹配的那3个值会被找出来并放到相应的位置上，
如果找不到相应的索引值，其结果就为NaN（即非数字，not a number）

使用缺失或NA表示缺失数据。pandas的isnull和notnull函数可用于检测
缺失数据：

In [36]:
pd.isnull(obj4)

b    False
d     True
a    False
c    False
dtype: bool

In [37]:
pd.notnull(obj4)

b     True
d    False
a     True
c     True
dtype: bool

Series类似实例的方法：

In [38]:
obj4.isnull()

b    False
d     True
a    False
c    False
dtype: bool

DataFrame

DataFrame是一个表格型的数据结构，它含有一组有序的列，每列可以是不同的值的类型
（数值、字符串、布尔值等）
DataFrame既有行索引也有列索引，它可以被看作由Series组成的字典。
DataFrame中的数据是以一个或多个二维块存放的，而不是列表、字典、
或别的一维数据结构。

In [39]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada',
'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [40]:
frame = pd.DataFrame(data)

In [41]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [42]:
frame.head() #选取前五行

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

如果指定了序列，则DataFrame的列会按照指定的顺序进行排列

In [43]:
pd.DataFrame(data,columns=['year','state','pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

如果传入的列在数据中找不到，就会在结果中产生缺失值：

In [45]:
frame2 = pd.DataFrame(data,columns=['year','state','pop','debt'],index = ['one','two','three','four','five','six'])

In [46]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [47]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [48]:
frame2.index

Index(['one', 'two', 'three', 'four', 'five', 'six'], dtype='object')

通过类似字典标记的方式或属性的方式，可以将DataFrame的列获取为一个
Series：

In [49]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [50]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

frame2[column]适用于任何列的名，但是frame2.column只有在列名是一个
合理的python变量名时才适用；

行也可以通过位置或名称的方式进行获取，比如用loc属性

In [51]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

列可以通过赋值的方式进行修改。
例如：给空的‘debt’列赋值一个标量或一组值

In [52]:
frame2['debt'] = 6

In [53]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5     6
two    2001    Ohio  1.7     6
three  2002    Ohio  3.6     6
four   2001  Nevada  2.4     6
five   2002  Nevada  2.9     6
six    2003  Nevada  3.2     6

In [58]:
import numpy as np
frame2['debt'] = np.arange(6.)

In [59]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

如果赋值的是一个series，就会精确匹配DataFrame的索引，所有的空位
都将被填上缺失值；

In [60]:
val = pd.Series([-1.2,-1.5,-1.7],index = ['two','four','five'])

In [61]:
frame2['debt'] = val

In [63]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

为不存在的列赋值会创建出一个新列，关键字del用于删除列

In [64]:
frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

注意不能用frame2.eastern创建新的列

del方法可以用来删除列

In [65]:
del frame2['eastern']

In [66]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

通过索引方式返回的列只是相应数据的视图而已，并不是副本。
因此，对返回的Series所做的任何就地修改全部都会反应到源DataFrame上。
通过Series的copy方法即可指定复制列。

另一种常见的数据形式是嵌套字典：

In [67]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

如果嵌套字典传给DataFrame，pandas就会被解释为：外层字典的键作为列，
内层键则作为行索引：

In [68]:
frame3 = pd.DataFrame(pop)

In [69]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

可以使用NumPy的数组的方法，对DataFrame进行转置（交换行和列）

In [70]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [71]:
frame3.values

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.6]])

In [72]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

索引对象

index对象是不可变的，因此用户不能对其进行修改
不可变可以使index对象在多个数据结构之间安全共享

In [73]:
labels = pd.Index(np.arange(3))

In [74]:
labels

Int64Index([0, 1, 2], dtype='int64')

In [75]:
obj2 = pd.Series([1.5,2.5,0],index = labels)

In [76]:
obj2

0    1.5
1    2.5
2    0.0
dtype: float64

In [77]:
obj2.index is labels

True

In [78]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [79]:
frame3.columns

Index(['Nevada', 'Ohio'], dtype='object')

In [80]:
'Ohio' in frame3.columns

True

基本功能

重新索引

reindex的作用是创建一个新的对象。

In [81]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a',
'c'])

In [82]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

用该Series的reindex将会根据新索引进行重排。
如果某个索引值当前不存在，就引入缺失值；

In [83]:
obj2 = obj.reindex(['a','b','c','d','e'])

In [84]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [85]:
obj3 = pd.Series(['blue','purple','yellow'],index = 
                [0,2,4])

In [86]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [87]:
obj3.reindex(range(6),method = 'ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

reindex可以修改行索引和列，只传递一个序列时，会重新索引结果的行：

In [88]:
frame = pd.DataFrame(np.arange(9).reshape(3,3),
                    index = ['a','c','d'],
                    columns = ['Ohio','Texas','California'])

In [89]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [90]:
frame2 = frame.reindex(['a','b','c','d'])

In [91]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

列可以用columns关键字重新索引：

In [92]:
states = ['Texas','Utah','California']

In [93]:
frame.reindex(columns = states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

丢弃指定轴上的项

drop方法返回的是一个在指定轴上删除了指定值的心对象：

In [94]:
obj = pd.Series(np.arange(5.),index = ['a','b','c','d','e'])

In [95]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [96]:
new_obj = obj.drop('c')

In [97]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [98]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [99]:
obj.drop(['d','c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [103]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                       index=['Ohio', 'Colorado', 'Utah', 'New York'],columns=['one', 'two', 'three','four'])

In [104]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

用标签序列调用drop会从标签（axis = 0）删除值：

In [107]:
data.drop(['Colorado','Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

通过传递axis = 1或axis = 'columns'可以删除列的值

In [108]:
data.drop('two',axis = 1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [109]:
data.drop(['two','four'],axis = 'columns')

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

索引、选取和过滤

Series 索引(obj[...])的工作方式类似于 NumPy 数组的索引，只不过 Series 的索引值不只是整数。

In [110]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])

In [111]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [112]:
obj['b']

1.0

In [113]:
obj[['b','c']]

b    1.0
c    2.0
dtype: float64

In [114]:
obj[1]

1.0

In [115]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [116]:
obj[[1,3]]

b    1.0
d    3.0
dtype: float64

In [117]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

利用标签的切片运算与普通的python切片运算不同，其末端是包含的：

用切片可以对series的相应部分进行设置：

In [118]:
obj['b','c'] = 5

In [119]:
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

用一个值或序列对DataFrame进行索引其实就是获取一个或多个列：

In [121]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),              
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                   columns=['one', 'two', 'three',
'four'])

In [122]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [123]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [124]:
data[['three','one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

通过切片或布尔型数组选取数据

In [125]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [126]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [127]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [129]:
data[data < 5] = 0

In [131]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

用loc和iloc进行选取

使用轴标签（loc）或整数索引（iloc），从DataFrame选择行和列的自己

通过标签选择一行和多列：

In [132]:
data.loc['Colorado',['three','two']]

three    6
two      5
Name: Colorado, dtype: int64

用iloc和整数进行选取

In [133]:
data.iloc[2,[3,0,1]]

four    11
one      8
two      9
Name: Utah, dtype: int64

In [134]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [135]:
data.iloc[[1,2],[3,0,1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

这两个索引函数也适用于一个标签或多个标签的切片

In [136]:
data.loc[:'Utah','two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int64

In [137]:
data.iloc[:,:3][data.three > 5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

df[val]  --从DataFrame选取单列或一组列；在特殊情况下比较便利
df.loc[val] --通过标签，选取DataFrame的单个行或一组行
df.loc[:,val] --通过标签，选取单列或列子集
df.loc[val1,val2] --通过标签，同时选取行和列
df.iloc[where] --通过整数位置，从DataFrame选取单个行或行子集
da.iloc[:,where] --通过整数位置，从DataFrame选取单个列或列子集
df.iloc[where_i,where_j] --通过整数位置，同时选取行和列

In [138]:
ser2 = pd.Series(np.arange(3.), index=['a', 'b', 'c'])

In [139]:
ser2

a    0.0
b    1.0
c    2.0
dtype: float64

In [140]:
ser2[-1]

2.0

为了进行统一，如果轴索引含有整数，数据选取总会使用标签。
为了更准确，要使用loc（标签）或iloc（整数）

In [141]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

将函数应用到由各列或行所形成的一维数组上。
DataFrame的apply方法实现此功能：

In [142]:
f = lambda x : x.max() - x.min()

In [143]:
frame.apply(f)

Ohio          6
Texas         6
California    6
dtype: int64

In [144]:
frame.apply(f,axis = 1)

a    2
c    2
d    2
dtype: int64

In [145]:
frame.apply(f,axis = 0)

Ohio          6
Texas         6
California    6
dtype: int64

函数f，计算了一个Series的最大值和最小值，在grame的每列
（每行）都执行一次。结果是一盒series，使用frame的
列（行）作为索引

In [147]:
frame.apply(f,axis = 'columns')

a    2
c    2
d    2
dtype: int64

许多常见的数组统计功能都被实现成DataFrame的方法（如sum
和mean），因此无需使用apply方法

In [148]:
def f(x):
    return pd.Series([x.min(),x.max()],index
                    = ['min','max'])

In [149]:
frame.apply(f)

     Ohio  Texas  California
min     0      1           2
max     6      7           8

元素级的python函数也可以用。
比如：要得到frame中各个浮点值的格式化字符串，使用applymap：

In [150]:
format = lambda x : '%.2f' %x

In [151]:
frame.applymap(format)

   Ohio Texas California
a  0.00  1.00       2.00
c  3.00  4.00       5.00
d  6.00  7.00       8.00

排序和排名

要对行或列索引进行排序，可以使用sort_index方法，
它将返回一个已排序的新对象：

In [152]:
frame = pd.DataFrame(np.arange(8).reshape((2,4)),
                    index = ['three','one'],
                    columns = ['d','a','b','c'])

In [153]:
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [154]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [159]:
frame.sort_index(axis = 1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [160]:
frame.sort_index(axis = 1).sort_index(axis = 0)

       a  b  c  d
one    5  6  7  4
three  1  2  3  0

数据默认是按生序排序的，但也可以降序排序

In [161]:
frame.sort_index(axis = 1,ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

按值对series进行排序，使用sort_values

In [162]:
obj = pd.Series([4,7,-3,2])

In [163]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

在排序时，任何缺失值默认都会被放到Series的末尾

当排序一个 DataFrame 时，你可能希望根据一个或多个列中的值进行排序。将 一个或多个列的名字传递给 sort_values 的 by 选项即可达到该目的

In [164]:
frame = pd.DataFrame({'b':[4,7,-3,2],
                     'a':[0,1,0,1]})

In [165]:
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [166]:
frame.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [167]:
frame.sort_values(by = ['a','b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [168]:
obj = pd.Series([7,-5,7,4,2,0,4])

In [170]:
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [169]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

带有重复标签的轴索引

In [177]:
obj = pd.Series(range(5),index = ['a','a','b','b','c'])

In [178]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

索引的is_unique属性可以查看值是否是唯一的

In [179]:
obj.index.is_unique

False

In [180]:
obj['a']

a    0
a    1
dtype: int64

In [181]:
obj['c']

4

In [182]:
df = pd.DataFrame(np.random.randn(4, 3), index=['a', 'a',
'b', 'b'])

In [183]:
df

          0         1         2
a  0.732621  0.259244  1.619042
a  1.323889  1.735491 -2.511802
b  0.785733  2.027094  0.076884
b -0.216552 -0.711941 -0.764709

In [184]:
df.loc['b']

          0         1         2
b  0.785733  2.027094  0.076884
b -0.216552 -0.711941 -0.764709

汇总和计算描述性统计

In [185]:
df = pd.DataFrame([[1.4,np.nan],[7.1,-4.5],
                   [np.nan,np.nan],[0.75,-1.3]],
                 index = ['a','b','c','d'],
                 columns = ['one','two'])

In [186]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

调用DataFrame的sum方法返回一个含有列的和的Series：

In [187]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [188]:
df.sum(axis = 0)

one    9.25
two   -5.80
dtype: float64

In [189]:
df.sum(axis = 1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [192]:
df.sum(axis = 'columns')

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

axis 简约的轴，DataFrame的行用0，列用1

idmax：达到最小值的索引
idmin：达到最小值的索引

累计型的统计：

In [193]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

describe,用于一次性产生多个汇总统计

In [194]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [198]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [197]:
df.loc['b'].sum()

2.5999999999999996

In [199]:
df['one'].sum()

9.25

In [200]:
df.loc[:,'one'].sum()

9.25

相关系数与协方差

DataFrame的corr和cov方法将以DataFrame的形式返回完整
的相关系数或协方差矩阵

In [203]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [204]:
df.corr()

     one  two
one  1.0 -1.0
two -1.0  1.0

In [205]:
df.cov()

           one    two
one  12.205833 -10.16
two -10.160000   5.12

唯一值、值计数以及成员资格

In [206]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c',
'c'])

In [207]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [216]:
uniques = obj.unique()

In [217]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

value_counts用于计算一个Series中各值出现的次数：

In [222]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

isin用于判断矢量化集合的成员资格，可用于过滤Series中或DataFrame列
中数据的子集：

In [223]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [224]:
mask = obj.isin(['b','c'])

In [225]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [226]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

# 第六章 数据加载、存储与文件格式

read_csv 从文件、URL、文件型对象中加载带分隔符的数据。默认分隔符为逗号
read_table 从文件、URL、文件型对象中加载带分隔符的数据。默认分隔符为制表符（\t）

pandas.read_csv有类型推断功能，因为列数据的类型不属于数据类型。

使用read_table，并制定分隔符：

pd.read_table('examples/exl.csv',sep = ',')

有的文件没有标题行，1.可以让pandas为其分配默认的列名，
也可以自己定义列名：

pd.read_csv('examples/ex2.csv',header = None)
pd.read_csv('examples/ex2.csv',names = ['a','b',
                                       'c','d','message'])

指定某一列作为dataframe的索引，可以通过index_col参数指定索引

names = ['a','b','c','d','message'])
pd.read_csv('examples/ex2.csv',names = names,index_col = 'message')

如果希望将多个列做成一个层次化索引，只需传入由列编号或列名组成的列表即可）

parsed = pd.read_csv('examples/csv_mindex.csv',
                      index_col=['key1', 'key2'])

有些表格可能不是用固定的分隔符去分隔字段的(比如空白符或
其他模式来分隔字段)，可以传递一个正则表达式作为 read_table 的分隔符。可以 用正则表达式表达为\s+

rest = pd.read_table('examples/ex3.txt',sep = '\s+')

read_table推断第一列硬币是DataFrame的索引

skiprows可以跳过指定的行

pd.read_csv('examples/ex4.csv',skiprows = [0,2,3])

pandas经常用NA及NULL表示缺失值

pd.isnull(df) #布尔运算，查看df中为缺失值的元素

na_values可以用一个列表或集合的字符串表示缺失值

reast = pd.read_csv('examples/ex5.csv',na_values = ['NULL'])

read_csv/read_table函数的参数

path 表示文件系统位置、URL、文件型对象的字符串
sep或delimiter 用于对行中各字段进行拆分的字符串序列或正则表达式
header 用作列名的行号。默认为0（第一行），如果没有header行就应该设置为None
index_col 用作行索引的列编号或列名。可以是单个名称/数字或由多个名称/数字组成的列表[层次化索引]
names 用于结果的列名列表，结合header = None
skiprows 需要忽略的行树（从文件开始处算起），或需要跳过的行号列表（从0开始）
na_values 一组用于替换NA的值
comment 用于将注释信息从行尾拆分出去的字符
encoding 用于unicode的文本编码格式。

在看大文件前，可以设置pandas显示行数：
pd.options.display.max_rows = 10

将数据写出到文本格式

利用DataFrame的to_csv方法，可以将数据写到一个以逗号分隔的文件中：

In [ ]:
data = pd.read_csv('examples/ex5.csv')
data.to_csv('examples/out.csv')

In [ ]:
with open('examples/ex7.csv') as f:
    lines = list(csv.reader(f))

header,values = lines[0],lines[1:]
#用字典构造式和zip（*values），后者将行转置为列，创建数据字典：
data_dict = {h:v for h,v in zip(header,zip(*values))}

csv文件的形式有很多，只需定义csv.Dialect的一个子类即可定义出新格式
（如专门的分隔符、字符串引用约定、行结束符等）

In [ ]:
class my_dialect(csv.Dialect):
    linerterminator = '\n'
    delimiter = ';'
    quotecher = '"'
    quothing = csv.QUOTE_MINIMAL
reader = csv.reader(f,dialect = my_dialect)

JSON数据

JSON 非常接近于有效的 Python 代码。基本类型有对象(字典)、数组 (列表)、字符串、数值、布尔值以及 null
对象中所有的键都必须是字符串

通过json.loads 即可将JSON字符串转换成python形式：

In [241]:
obj = '''{"name": "Wes","places_lived": ["United States", "Spain", "Germany"],"pet": null,"siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
        {"name": "Katie", "age": 38,"pets": ["Sixes", "Stache", "Cisco"]}]}'''

In [228]:
import json

In [229]:
result = json.loads(obj)

In [234]:
result

{'name': 'Wes',
 'pet': None,
 'places_lived': ['United States', 'Spain', 'Germany'],
 'siblings': [{'age': 30, 'name': 'Scott', 'pets': ['Zeus', 'Zuko']},
  {'age': 38, 'name': 'Katie', 'pets': ['Sixes', 'Stache', 'Cisco']}]}

json.dumps则将python对象转换成JSON格式：

In [242]:
asjson = json.dumps(result)

In [243]:
asjson

'{"name": "Wes", "places_lived": ["United States", "Spain", "Germany"], "pet": null, "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]}, {"name": "Katie", "age": 38, "pets": ["Sixes", "Stache", "Cisco"]}]}'

如何将(一个或一组)JSON 对象转换为 DataFrame 或其他便于分析的数据结构 就由你决定了。最简单方便的方式是:向 DataFrame 构造器传入一个字典的列 表(就是原先的 JSON 对象)，并选取数据字段的子集

In [244]:
siblings = pd.DataFrame(result['siblings'],columns = ['name',
                                                     'age'])

In [245]:
siblings

    name  age
0  Scott   30
1  Katie   38

In [ ]:
data = pd.read_json('examples/example.json')

将数据从 pandas 输出到 JSON，可以使用 to_json 方法:

In [246]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [247]:
print(data.to_json())

{"one":{"Ohio":0,"Colorado":0,"Utah":8,"New York":12},"two":{"Ohio":0,"Colorado":5,"Utah":9,"New York":13},"three":{"Ohio":0,"Colorado":6,"Utah":10,"New York":14},"four":{"Ohio":0,"Colorado":7,"Utah":11,"New York":15}}